novel_schema = dict(
    task_description = 'Adapted from the novel into script', # 小说改编成剧本
    attributes = [
        dict(
            name='role', 
            description='The character who is speaking',
            type='String'
            ), # 角色
        dict(
            name='dialogue',
            description='The dialogue spoken by the characters in the sentence',
            type='String'
            ), # 对话
    ],
    example = [
        dict(
            text = """
            孔明见众官中，一人仰天而笑，面亦有喜色。孔明视之，乃义阳新野人，姓邓，名芝，字伯苗，现为户部尚书；汉司马邓禹之后。孔明暗令人留住邓芝。多官皆散，孔明请芝到书院中，问芝曰：“今蜀、魏、吴鼎分三国，欲讨二国，一统中兴，当先伐何国？”
            芝曰：“以愚意论之：魏虽汉贼，其势甚大，急难摇动，当徐徐缓图；今主上初登宝位，民心未安，当与东吴连合，结为唇齿，一洗先帝旧怨，此乃长久之计也。未审丞相钧意若何？”孔明大笑曰：“吾思之久矣，奈未得其人。今日方得也！”芝曰：“丞相欲其人何为？”
            孔明曰：“吾欲使人往结东吴。公既能明此意，必能不辱君命。使吴之任，非公不可。”芝曰：“愚才疏智浅，恐不堪当此任。”孔明曰：“吾来日奏知天子，便请伯苗一行，切勿推辞。”芝应允而退。至次日，孔明奏准后主，差邓芝往说东吴。芝拜辞，望东吴而来。正是：吴人方见干戈息，蜀使还将玉帛通。未知邓芝此去若何，且看下文分解。
            """,
            script = [
                {"role": "孔明", "dialogue": "今蜀、魏、吴鼎分三国，欲讨二国，一统中兴，当先伐何国？"},
                {"role": "邓芝", "dialogue": "以愚意论之：魏虽汉贼，其势甚大，急难摇动，当徐徐缓图；今主上初登宝位，民心未安，当与东吴连合，结为唇齿，一洗先帝旧怨，此乃长久之计也。未审丞相钧意若何？"},
                {"role": "孔明", "dialogue": "吾思之久矣，奈未得其人。今日方得也！"},
                {"role": "邓芝", "dialogue": "丞相欲其人何为？"},
                {"role": "孔明", "dialogue": "吾欲使人往结东吴。公既能明此意，必能不辱君命。使吴之任，非公不可。"},
                {"role": "邓芝", "dialogue": "愚才疏智浅，恐不堪当此任。"},
                {"role": "孔明", "dialogue": "吾来日奏知天子，便请伯苗一行，切勿推辞"},
            ]
        )
    ]
)